print('Введите строку для шифрования')
strForСipher = input()
print('Введите сдвиг')
shift = int(input()) 
strСipher = 'А Б В Г Д Е Ё Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я'

Сipher = strСipher.split(' ')
#strСipher = {0: 'А', 1: 'Б', 2:'В', 3:'Г', 4:'Д', 5:'Е', 6:'Ё', 7:'Ж', 8:'З', 9:'И', 10:'Й', 11:'К', 12:'Л', 14:'М', 14:'Н', 15:'О', 16:'П', 17:'Р', 18:'С', 19:'Т', 20:'У', 21:'Ф', 22:'Х', 23:'Ц', 24:'Ч', 25:'Ш', 26:'Щ', 27:'Ъ', 28:'Ы', 29:'Ь', 30:'Э', 31:'Ю', 32:'Я'}
s = 'зашифрованная строка: '
for k in strForСipher:
    s = s + Сipher[(Сipher.index(k) + shift)%33]
print(s)